# Pandas

In [1]:
import pandas as pd

In [2]:
# define a series 
s1 = pd.Series([3, 7, 4, 8])
s1

0    3
1    7
2    4
3    8
dtype: int64

In [3]:
s2 = pd.Series(['a', 'f', 'g'])
s2

0    a
1    f
2    g
dtype: object

In [4]:
s3 = pd.Series([3.6, 7.2, 18.9])
s3

0     3.6
1     7.2
2    18.9
dtype: float64

In [5]:
d = pd.DataFrame({
    'apples': [2, 3, 8],
    'oranges': [7, 4, 1]
}
)
d

   apples  oranges
0       2        7
1       3        4
2       8        1

In [6]:
data = {
    'apples': [2, 3, 8],
    'oranges': [7, 4, 1]
}

In [7]:
purshases = pd.DataFrame(data)
purshases

   apples  oranges
0       2        7
1       3        4
2       8        1

In [8]:
purshases = pd.DataFrame(data, index=['David', 'Ahmed', 'Ali'])
purshases

       apples  oranges
David       2        7
Ahmed       3        4
Ali         8        1

In [9]:
purshases.loc['Ali']

apples     8
oranges    1
Name: Ali, dtype: int64

In [10]:
purshases.loc['David']

apples     2
oranges    7
Name: David, dtype: int64

In [11]:
purshases.apples

David    2
Ahmed    3
Ali      8
Name: apples, dtype: int64

In [12]:
purshases['apples']

David    2
Ahmed    3
Ali      8
Name: apples, dtype: int64

In [13]:
df = pd.read_csv('../dataset/purchases.csv')
df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

In [14]:
df = pd.read_csv('../dataset/purchases.csv', index_col=0)
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [15]:
df = pd.read_json('../dataset/purchases.json')
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [21]:
import sqlite3
con = sqlite3.connect("../dataset/database.db")

In [22]:
df = pd.read_sql_query("SELECT * FROM purchases", con)
df

    index  apples  oranges
0    June       3        0
1  Robert       2        3
2    Lily       0        7
3   David       1        2

In [23]:
df = df.set_index('index')
df

        apples  oranges
index
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [24]:
df.to_csv('../dataset/new_purchases.csv')

In [25]:
df.describe()

         apples  oranges
count  4.000000  4.00000
mean   1.500000  3.00000
std    1.290994  2.94392
min    0.000000  0.00000
25%    0.750000  1.50000
50%    1.500000  2.50000
75%    2.250000  4.00000
max    3.000000  7.00000

In [26]:
df.describe().transpose()

         count  mean       std  min   25%  50%   75%  max
apples     4.0   1.5  1.290994  0.0  0.75  1.5  2.25  3.0
oranges    4.0   3.0  2.943920  0.0  1.50  2.5  4.00  7.0

In [28]:
df.describe().transpose().loc['apples']

count    4.000000
mean     1.500000
std      1.290994
min      0.000000
25%      0.750000
50%      1.500000
75%      2.250000
max      3.000000
Name: apples, dtype: float64

In [29]:
df.describe()['apples']

count    4.000000
mean     1.500000
std      1.290994
min      0.000000
25%      0.750000
50%      1.500000
75%      2.250000
max      3.000000
Name: apples, dtype: float64

In [30]:
df.describe()

         apples  oranges
count  4.000000  4.00000
mean   1.500000  3.00000
std    1.290994  2.94392
min    0.000000  0.00000
25%    0.750000  1.50000
50%    1.500000  2.50000
75%    2.250000  4.00000
max    3.000000  7.00000

In [31]:
df.describe().oranges.loc['max']

7.0

In [32]:
df.oranges

index
June      0
Robert    3
Lily      7
David     2
Name: oranges, dtype: int64

In [33]:
df.oranges.max()

7

In [34]:
df.head()

        apples  oranges
index
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [35]:
df.head(2)

        apples  oranges
index
June         3        0
Robert       2        3

In [36]:
df.tail(2)

       apples  oranges
index
Lily        0        7
David       1        2